



def get_movie():
    """輸出格式:

    (
     [
        [A類電影],
        [B類電影],
        [C類電影]......
     ],
     [
        電影分類標籤
     ]
    
    )

    """
    return ([["m1","m2","m3","m4","m5","m6","m7","m8","m9"],
                ["m10","m11","m12"],["m13","m14","m15"]] , ["kind1","kind2","kind3"])
def get_theater(movie : str):
    """輸出格式:

    (
     [
        [A縣電影院],
        [B市電影院],
        [C縣電影院]......
     ],
     [
        縣市
     ]
    
    )

    依據輸入的movie
    得出會上映這部電影的電影院

    """
    return ([["t__1","t__2","t__3","t__4","t__5","2t1","2t2","2t3","2t4","2t5","2t1","2t2","2t3","2t4","2t5"],
                  ["2t1","2t2","2t3","2t4","2t5"],["t__1","t__2","t__3","t__4","t__5"]],
                  ["city 1","city 2","city 3"])
def get_time(movie : str,theater : str):
    """輸出格式:

    (
     [
        [第一天時間列表],
        [第二天時間列表],
        [第三天時間列表]
     ],
     [
        
     ]
    
    )

    依據輸入的theater和movie
    這部電影在這個電影院三天的時間表

    時間我希望日期加上時間，如:
    "7/25 19:00 - 21:00"
    
    """
    return ([["1","2","3","4","5","6","7","8"],
                  ["1","2","3","4","5","6","7","8"],
                  ["1","2","3","4","5","6","7","8"],
                  ["1","2","3","4","5","6","7","8"],
                  ["1","2","3","4","5","6","7","8"]],
                  ["1","2","3","4","5"])